In [1]:
import numpy as np
import pandas as pd

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [95]:
df=pd.DataFrame(exam_data,index=labels)

In [5]:
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [6]:
df.head(3)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

In [17]:
df.iloc[[1,3,5,6]][['name','score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [20]:
df.loc[df['attempts']>2]

   attempts     name qualify  score
b         3     Dima      no    9.0
d         3    James      no    NaN
f         3  Michael     yes   20.0

In [24]:
df.loc[df['score'].isna()]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

In [37]:
df.loc[(df['score']>=15)& (df['score']<=20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

In [40]:
df.loc[(df['attempts']<2) & (df['score']>15)]

   attempts   name qualify  score
j         1  Jonas     yes   19.0

In [48]:
df['index']='d'

In [54]:
df['index']='d'

In [57]:
df.pop('index')

a    d
b    d
c    d
d    d
e    d
f    d
g    d
h    d
i    d
j    d
Name: index, dtype: object

In [58]:
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [61]:
df.loc['d','score']=11.5

In [62]:
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [65]:
df['score'].mean()

13.333333333333334

In [67]:
new_row={'name' : "Suresh", 'score': 15.5, 'attempts': 1, 'qualify': "yes"}
label=['k']

In [70]:
df.loc['k']=new_row

In [94]:
df

   attempts       name  qualify  score
a         1  Anastasia     True   12.5
b         3       Dima    False    9.0
c         2  Katherine     True   16.5
d         3      James    False    NaN
e         2      Emily    False    9.0
f         3    Michael     True   20.0
g         1    Matthew     True   14.5
h         1      Laura    False    NaN
i         2      Kevin    False    8.0
j         1      Jonas     True   19.0

In [80]:
df.sort_values(by=['name'])

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
e         2      Emily      no    9.0
d         3      James      no   11.5
j         1      Jonas     yes   19.0
c         2  Katherine     yes   16.5
i         2      Kevin      no    8.0
h         1      Laura      no    NaN
g         1    Matthew     yes   14.5
f         3    Michael     yes   20.0
k         1     Suresh     yes   15.5

In [97]:
df['qualify']=df['qualify']=='yes'

In [98]:
df

   attempts       name  qualify  score
a         1  Anastasia     True   12.5
b         3       Dima    False    9.0
c         2  Katherine     True   16.5
d         3      James    False    NaN
e         2      Emily    False    9.0
f         3    Michael     True   20.0
g         1    Matthew     True   14.5
h         1      Laura    False    NaN
i         2      Kevin    False    8.0
j         1      Jonas     True   19.0

In [125]:
df.loc[df.loc[df['name']=='James'].index[0],'name']='Suresh'

In [126]:
df

   attempts       name  qualify  score
a         1  Anastasia     True   12.5
b         3       Dima    False    9.0
c         2  Katherine     True   16.5
d         3     Suresh    False    NaN
e         2      Emily    False    9.0
f         3    Michael     True   20.0
g         1    Matthew     True   14.5
h         1      Laura    False    NaN
i         2      Kevin    False    8.0
j         1      Jonas     True   19.0

In [2]:
st='google.com'

In [3]:
from collections import Counter

In [4]:
Counter(st)

Counter({'.': 1, 'c': 1, 'e': 1, 'g': 2, 'l': 1, 'm': 1, 'o': 3})

In [62]:
st='resveratrol'

In [53]:
for i in range(0,len(st)):
    if i!=0:
        if st[i]==st[0]:
            print (st[i].replace(st[i],'$'),end='')
        else :
            print (st[i],end='')
    else:
            print (st[i],end='')

mira$ond

In [63]:
st[0]+st[1:].replace(st[0],'$')

'resve$at$ol'

In [75]:
st='string'

In [76]:
st

'string'

In [78]:
if st[-3:]=='ing':
    print (st+'ly')

stringly

In [79]:
from collections import Counter

In [80]:
lista=['elda','miraka','elda']

In [81]:
Counter(lista)

Counter({'elda': 2, 'miraka': 1})

In [86]:
list_num=[]
with open('numbers.txt','r') as f:
     for i in f:
            list_num.append(i.rstrip('\n'))

In [88]:
Counter(list_num)

Counter({'355692318313': 1,
         '355692804771': 1,
         '355692998153': 1,
         '355693140021': 1,
         '355693226386': 1,
         '355693801838': 1,
         '355693994593': 1,
         '355694010699': 1,
         '355694434812': 1,
         '355696918007': 1,
         '355696960770': 1,
         '355697357761': 1,
         '355697872072': 1,
         '355699623747': 1,
         '355699837381': 1})

In [102]:
with open('numbers.txt','r') as f:
            print (Counter(f.read().split(' ')))

Counter({'anche': 2, 'di': 2, 'un': 2, 'Luna': 1, 'piena': 1, 'manda': 1, 'in': 1, 'estasi': 1, "d'amore,": 1, 'ma': 1, 'ha': 1, 'la': 1, 'forza': 1, 'portare': 1, 'al': 1, 'culmine': 1, 'eventuali': 1, 'crisi': 1, 'presenti,': 1, 'specie': 1, 'nel': 1, 'matrimonio,': 1, 'quindi': 1, 'non': 1, 'escludiamo': 1, 'scenate': 1, 'e': 1, 'discussioni.': 1, 'Ma': 1, 'è': 1, 'bene': 1, 'che': 1, 'certi': 1, 'conflitti': 1, 'vengano': 1, 'allo': 1, 'scoperto,': 1, 'nelle': 1, 'collaborazioni,': 1, 'almeno': 1, 'sarete': 1, 'liberi': 1, 'da': 1, 'dubbio,': 1, 'capirete': 1, 'aver': 1, 'esagerato.': 1, 'Contatti': 1, 'sociali': 1, 'utilissimi': 1, 'alla': 1, 'carriera.': 1, 'Sera,': 1, 'stress.': 1})

In [104]:
k=(len(list_num)+(len(list_num)/2)/2)+len(list_num)/2

In [105]:
k

26.25

In [232]:
list_num=[1,5,9,12,16,18,23,28,39,40,42,45]

In [239]:
k=len(list_num)
k1=(k/2)+1

In [240]:
n=23

In [241]:
while n!=list_num[int(k1)]:
    if n>list_num[int(k1)]:
        k1=(k+k1)/2
    if n<list_num[int(k1)]:
        k1=(((k1/2)+k1)/2)
print (int(k1))

6

In [ ]:
k1

In [308]:
def bin_search(n,list_num):
    k=len(list_num)
    if len(lista)%2==0:
        k1=k/2
    else:
        k1=(k/2)+1
    while n!=list_num[int(k1)]:
        if n>list_num[int(k1)]:
            k1=(k+k1)/2
            print (k1)
        if n<list_num[int(k1)]:
            k1=((k-k1)/2)
            print (k1)
    print (int(k1))

In [314]:
lista=[1,5,9,12,16,18,23,28,39,40]

In [345]:
n=23

In [346]:
lista

[1, 5, 9, 12, 16, 18, 23, 28, 39, 40]

In [327]:
int(k1)

6

In [329]:
lista1=lista[int(k1):]

In [330]:
lista1

[23, 28, 39, 40]

In [331]:
k2=len(lista1)/2

In [332]:
int(k2)

2

In [333]:
lista2=lista1[:int(k2)]

In [334]:
lista2

[23, 28]

In [336]:
k3=len(lista2)/2

In [337]:
int(k3)

1

In [343]:
kn=k1+k2+0

In [344]:
int(kn)

8

In [455]:
def bin_search(n,list_num):
    high=len(list_num)
    low=0
    k=(low+(high-low))/2

    while n!=list_num[int(k)]:
        if n>list_num[int(k)]:
            low=k+1
            k=low+(high-low)/2
            if k>len(list_num):
                break
        if n<list_num[int(k)]:
            high=high-1
            k=(low+(high-low)/2)
            if k<0:
                break
    if k<0 or k>len(list_num):
        print ("element not found")
    else:
        return  ('element found at:',int(k))

In [456]:
lista=[3,5,9,12,16,18,23,28,39,40,42]

In [463]:
n=60

In [464]:
bin_search(n,lista)

element not found

In [613]:
lista=[14,46,43,27,57,31,37,13]

In [614]:
while lista[0]>lista[1] or lista[1]>lista[2] or lista[2]>lista[3] or lista[3]>lista[4] or lista[4]>lista[5] or lista[5]>lista[6]:
       for i in range(0,len(lista)-1):
        if lista[i+1]<lista[i]:
            k=lista[i]
            l=lista[i+1]
            lista[i]=l
            lista[i+1]=k

In [702]:
lista=[7,1,6,5,4]

In [703]:
def bubble_sort(lista):
    for i in range(len(lista)-1):
        for i in range(0,len(lista)-1):
    
            if lista[i+1]<lista[i]:
                k=lista[i]
                l=lista[i+1]
                lista[i]=l
                lista[i+1]=k
            
    return lista

In [704]:
bubble_sort(lista)

[1, 4, 5, 6, 7]

In [758]:
lista=[14,46,43,27,57,41,45,21,7]

In [761]:
def selection_sort(lista):
    for i in range(0,len(lista)):
        for j in range(i+1,len(lista)):
            if lista[j]<lista[i]:
                k=lista[i]
                l=lista[j]
                lista[i]=l
                lista[j]=k
            
    return lista

In [762]:
selection_sort(lista)

[7, 14, 21, 27, 41, 43, 45, 46, 57]

In [878]:
lista=[14,46,43,27,40]

In [143]:
def insertion_sort(lista):
    for i in range(len(lista)-1):
        if lista[i+1]<lista[i]:
            k=lista[i]
            l=lista[i+1]
            lista[i]=l  
            lista[i+1]=k
        
            for j in range (i):
                for j in range(i,0,-1):
                    if lista[j]<lista[j-1]:
                        k=lista[j]
                        l=lista[j-1]
                        lista[j]=l  
                        lista[j-1]=k
                      
    return lista

In [144]:
insertion_sort(lista)

[7, 14, 21, 27, 41, 43, 45, 46, 57]

In [145]:
import math

In [150]:
lista=[14,46,43,27,57,41,45,21,7,12]

In [151]:
def shell_sort(lista):
    from . import insertion_sort
    for h in range(int(math.log(len(lista)+1,2)),1,-2):
            for i in range(len(lista)-h):
                if lista[i+h]<lista[i]:
                    k=lista[i] 
                    l=lista[i+h]
                    lista[i]=l  
                    lista[i+h]=k
    insertion_sort(lista)
    return lista

In [152]:
shell_sort(lista)

[7, 12, 14, 21, 27, 41, 43, 45, 46, 57]

In [149]:
insertion_sort(lista)

[7, 14, 21, 27, 41, 43, 45, 46, 57]

In [156]:
def merge(h1,h2):
    i=0
    j=0
    k=0
    h=len(h1)+len(h2)
    lista=[]
    while k<h:
    
        if i<len(h1) and j<len(h2):
                if h1[i]>h2[j]:
                    lista.append(h2[j])
                    j=j+1
                    if j==(len(h2)):
                        while i<len(h1):
                                lista.append(h1[i])
                                i=i+1
                else:
                    lista.append(h1[i])
                    i=i+1 
                    if i==(len(h1)):
                        while j<len(h2):
                                lista.append(h2[j])
                                j=j+1
        
        k=k+1
    return lista

In [159]:
h1=[3]
h2=[2]

In [160]:
merge(h1,h2)

[2, 3]

In [173]:
array= [14, 7, 3, 12, 9, 11, 6, 2]

In [174]:
q=int((len(array)-1)/2)
q

3

In [175]:
array[0:3]

[14, 7, 3]

In [176]:
array[q+1:]

[9, 11, 6, 2]

In [178]:
array[0:4]

[14, 7, 3, 12]